Revit 2027 API
Water Class
 A static class that provides access to the property names that appear in the Water visual asset schema.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.Water
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class Water
Public NotInheritable Class Water
public ref class Water abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type Water = class end
The Water type exposes the following members.
Properties
Name | Description
CommonTintColor |  The property labeled "Tint Color" from the "Water" schema.
CommonTintToggle |  The property labeled "Tint" from the "Water" schema.
WaterBumpAmount |  The property labeled "Wave Height" from the "Water" schema.
WaterColorByObject |  The property labeled "Custom Color" from the "Water" schema.
WaterTintColor |  The property labeled "Custom Color" from the "Water" schema.
WaterTintEnable |  The property labeled "Color" from the "Water" schema.
WaterType |  The property labeled "Type" from the "Water" schema.
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace